{
    "games":  [
      {
        "id": 1,
        "name": "Minecraft",
        "description": "Minecraft is a sandbox video game developed and published by Mojang Studios. It allows players to build with a variety of different blocks in a 3D procedurally generated world, requiring creativity from players.",
        "rating": 9.3,
        "genre": ["Sandbox", "Survival"],
        "image": "https://upload.wikimedia.org/wikipedia/en/5/51/Minecraft_cover.png"
      },
      {
        "id": 2,
        "name": "Grand Theft Auto V",
        "description": "Grand Theft Auto V is an action-adventure game developed by Rockstar North and published by Rockstar Games. It is the fifth main installment in the Grand Theft Auto series, and players control three criminals and engage in heists.",
        "rating": 8.7,
        "genre": ["Action", "Adventure", "Open world"],
        "image": "https://upload.wikimedia.org/wikipedia/en/a/a5/Grand_Theft_Auto_V.png"
      },
      {
        "id": 3,
        "name": "The Witcher 3: Wild Hunt",
        "description": "The Witcher 3: Wild Hunt is an action role-playing game developed and published by CD Projekt Red. Players control Geralt of Rivia, a monster hunter known as a Witcher, and embark on a quest to find his missing adopted daughter.",
        "rating": 9.3,
        "genre": ["Action", "Role-playing"],
        "image": "https://upload.wikimedia.org/wikipedia/en/0/0c/Witcher_3_cover_art.jpg"
      },
      {
        "id": 4,
        "name": "Counter-Strike: Global Offensive",
        "description": "Counter-Strike: Global Offensive is a multiplayer first-person shooter video game developed by Valve and Hidden Path Entertainment. Players join one of two teams, the Terrorists or the Counter-Terrorists, and compete to complete objectives or eliminate the other team.",
        "rating": 8.5,
        "genre": ["First-person shooter", "Tactical shooter"],
        "image": "https://www.dictionary.com/e/wp-content/uploads/2018/07/CS-GO3.jpg"
      },
      {
        "id": 5,
        "name": "PlayerUnknown's Battlegrounds",
        "description": "PlayerUnknown's Battlegrounds is an online multiplayer battle royale game developed and published by PUBG Corporation. Players parachute onto an island and scavenge for weapons and equipment to kill others while avoiding being killed themselves.",
        "rating": 7.6,
        "genre": ["Battle royale", "Third-person shooter"],
        "image": "https://m.media-amazon.com/images/M/MV5BMTRkMjg2NDEtYzIxYi00MzZlLTllNmQtOTE4YWMzNjIwZDNkXkEyXkFqcGdeQXVyNTgyNTA4MjM@._V1_.jpg"
      },
      {
        "id": 6,
        "name": "Fortnite",
        "description": "Fortnite is an online video game developed by Epic Games. It is a battle royale game where up to 100 players fight to be the last person standing while building structures to protect themselves.",
        "rating": 8.1,
        "genre": ["Battle royale", "Third-person shooter"],
        "image": "https://static-cdn.jtvnw.net/ttv-boxart/33214-285x380.jpg"
      },
      {
        "id": 7,
        "name": "Overwatch",
        "description": "Overwatch is a team-based multiplayer first-person shooter developed and published by Blizzard Entertainment. Players select from a roster of heroes, each with their own unique abilities, and work together to complete objectives.",
        "rating": 9.0,
        "genre": ["First-person shooter", "Team-based"],
        "image": "https://upload.wikimedia.org/wikipedia/en/5/51/Overwatch_cover_art.jpg"
      },
      {
        "id": 8,
        "name": "World of Warcraft",
        "description": "World of Warcraft is a massively multiplayer online role-playing game developed and published by Blizzard Entertainment. Players create their own characters and explore a virtual world filled with quests, dungeons, and other players.",
        "rating": 8.5,
        "genre": ["MMORPG"],
        "image": "https://upload.wikimedia.org/wikipedia/en/6/65/World_of_Warcraft.png"
      },
      {
        "id": 9,
        "name": "Civilization VI",
        "description": "Civilization VI is a turn-based strategy game developed by Firaxis Games and published by 2K Games. Players control a civilization and guide it from ancient times to modern times, competing against other civilizations and achieving victory through various means.",
        "rating": 9.2,
        "genre": ["Turn-based strategy"],
        "image": "https://upload.wikimedia.org/wikipedia/en/3/3b/Civilization_VI_cover_art.jpg"
      },
      {
        "id": 10,
        "name": "Stardew Valley",
        "description": "Stardew Valley is a farming simulation game developed by ConcernedApe and published by Chucklefish. Players inherit a run-down farm and must restore it to its former glory by growing crops, raising animals, and forming relationships with the other residents of the nearby town.",
        "rating": 8.8,
        "genre": ["Simulation", "Farming"],
        "image": "https://upload.wikimedia.org/wikipedia/en/f/fd/Logo_of_Stardew_Valley.png"
      }

    ],
    "reviews": [{"id":1,"rating":8.2,"comment":"I loved the graphics and the storyline. The ending left me wanting more!","title":"Amazing game!"},{"id":1,"rating":4.5,"comment":"I found the controls difficult to use and the plot was predictable. Overall, not my favorite game.","title":"Disappointing"},{"id":2,"rating":9.3,"comment":"The gameplay is fantastic and the visuals are stunning. One of the best games I've played in a long time.","title":"Incredible"},{"id":2,"rating":6.7,"comment":"While the story was interesting, the gameplay was a bit too repetitive for my liking.","title":"Good but not great"},{"id":3,"rating":7.8,"comment":"The puzzles were challenging but not too difficult. I had a lot of fun playing this game.","title":"Great game for puzzle lovers"},{"id":3,"rating":3.2,"comment":"The game was buggy and frustrating to play. Would not recommend.","title":"Not worth it"},{"id":4,"rating":8.9,"comment":"The open world is amazing and there are so many quests to complete. I can't stop playing!","title":"Awesome game!"},{"id":4,"rating":5.4,"comment":"The gameplay was too repetitive for my liking and the story was forgettable.","title":"Not my cup of tea"},{"id":5,"rating":9.1,"comment":"The storyline was gripping and the graphics were stunning. I couldn't put it down!","title":"Amazing"},{"id":5,"rating":7.2,"comment":"While the gameplay was fun, the story was a bit too predictable for my liking.","title":"Good but not great"},{"id":6,"rating":7.6,"comment":"The game is a lot of fun and the soundtrack is great. Would definitely recommend!","title":"Fun game"},{"id":6,"rating":2.8,"comment":"The controls were difficult to use and the gameplay was too repetitive for my liking.","title":"Not worth it"},{"id":7,"rating":8.5,"comment":"The story was intriguing and the graphics were amazing. Highly recommend!","title":"Awesome"},{"id":7,"rating":6.1,"comment":"The game was too short and the story was a bit underwhelming.","title":"Disappointing"},{"id":8,"rating":8.4,"comment":"I absolutely loved this game! The graphics were stunning and the gameplay was so smooth. I would highly recommend it to anyone who loves adventure games.","title":"Amazing game!"},{"id":8,"rating":4.2,"comment":"Honestly, I was pretty disappointed with this game. The storyline was weak and the graphics weren't anything special. It was just an average game at best.","title":"Not worth the hype"},{"id":9,"rating":9.8,"comment":"This game is simply amazing! The graphics are stunning and the storyline is so engaging. I could play this for hours on end and never get bored.","title":"My new favorite game"},{"id":9,"rating":7.6,"comment":"I enjoyed playing this game, but it didn't quite live up to the hype for me. The graphics were good, but the gameplay was a bit repetitive.","title":"Decent game, but not the best"},{"id":10,"rating":6.3,"comment":"I was really excited for this game, but it ended up being pretty underwhelming. The graphics were okay, but the storyline was weak and the gameplay was a bit boring.","title":"Disappointing game"},{"id":10,"rating":9.2,"comment":"I really enjoyed playing this game! The graphics were great and the gameplay was really fun. I would definitely recommend it to anyone who loves action games.","title":"Great game!"}]

}
